--Thinking About Performance
-- در اینکه چگونه اطلاعات در هارد دیسک ذخیره میشن
-- و نحوه دسترسی به ان و تفاوت ذخیره اون ها
-- و ابزار هایی که داریم چگونه کار میکنن و عملکرد واقعی دیتابیس
-- خب ما در این بخش ها نحوه ساختار بندی پسگرس و عملکرد ان ها میپردازیم
-- و سپس به اجرا کوئری ها و درک عملکرد دقیق دیتابیس میپردازیم
-- پس ما درنهایت ذخیره اطلاعات توسط پایگاه داده و قرار داد درون هارد دیسک رو برسی میکنیم
-- و بصورت کد های باینری 


--------------------------------------------------------------
--  Where Does Postgres Store Data
-- خب در این بخش میخوای نگاهی کنیم به پستگرس و اطلاعاتی که در دیسک ما ذخیره میکند

-- با اجرا کردن این دستور ما به یک مسیر میرسیم
-- /var/lib/postgresql/data
-- این مسیر فهرست موجود در رایانه شخصی من است  که پستگرس روی ان نصب شده است
-- پس ما میتونیم این پوشه رو داخل اکسپلور باز کنیم و محتویات درون ان هارو ببینیم
-- برای مثال : 
--             ما میخوایم دیتابیس اینستاگرامی را که ساختیم
--             فایل های داخلش رو مشاهده کنیم

-- ** SHOW data_directory;

-- تمام داده های مربوط به بانک های اطلاعاتی در داخل پوشه ای بنام بیس یا فهرست پایه قرار دارند
-- و در نهایت بعد از باز کردن این پوشه به پوشه هایی میرسیم که با اعدادی نام گذاری شده اند
-- هر کدوم از این پوشه ها حاوی تمام داده هابرای یک پایگاه داده متفاوت است
-- پس میتونیم بفهمیم این اعداد برای اجرا کردن یک پایگاه داده و پرس و جو های مختلف در 
-- پی جی ادمین استفاده میشوند


--** SELECT
-- **      oid,
-- **     datname
-- **  FROM
-- **    pg_database;

-- با اجرا کد بالا میتونیم تمام بانک های اطلاعاتی مختلف
-- در داخل نصب پستگرس رو به ما نمایش میده

-- خب حالا ما با اجرا این کد میتونیم فایل ها و دایرکتوری های بیشتری رو مشاهده کنیم

-- SELECT * FROM pg_class;
-- خب هر کدوم از این ردیف ها حاوی اطلاعتی در مورد یکی از پرونده های مختلف است
-- هر پرونده به نوبه خودش یک شی جداگونه رو در داخل دیتابیس به ما نمایش میده
-- اشیا توی دیتابیس ما فقط جدول ها نیستن
-- موارد دیگه ای که شامل اشای میشن

-- 1-کلید های اصلی
-- 2- ایندکس ها
-- 3- کلید های خارجی

-- خب برای مثال ما میتونیم جدول کاربران رو از داخل خروجی که ایجاد کردیم مشاهده کنیم


--** SELECT
--**      oid
--**       FROM pg_class
--**       WHERE relname IN ('users','posts')
--** output =>(
--** 65538
--** 65550
--** )

---------------------------------------------------------------------
--Heaps, Blocks, and Tuples

-- خب ما در بالا تونستیم اطلاعات مربوط به پسا ها و کاربران و دریافت کنیم
-- حالا میخوایم برسی کنیم چطوری میتونیم این اطلاعات رو در یک پرونده ذخیره کنیم
-- خب در ادامه باید چند اصطلاح مهم درباره پایگاه داده رو درک کنیم

-- 1-Heap OR HeapFile :
--                     این فایلی است که شامل تمام دیتاهای مربوط به یک
--                     جدول خاص است و در واقع اطلاعات بدست اومده
--                     از جداول کاربران و پست ها درون فایل
--                     هیپ قرار دارند
--                     و درواقع شامل اطلاعاتی درباره جداول من است


-- 2- Tuple OR Item : 
--                     اینها از یک جدول خاص به ردیف های جداگانه اشاره میکنن

-- 3-Block OR Page : 
--                 یک فایل گرمای واحد به بسیاری از بلوک ها یا صفحات مختلف تنظیم میکند

-- حالا میخوایم برای مثال این فایل که شامل کاربران است رو برسی کنیم
-- 65538
-- یک پرونده به بسایری از بلوک ها و یا صفحات مختلف تقسیم میشود و سپس هر بلوک یا صفحات تقسیم میشود 
-- و سپس هر بلوک یا صفحه مقداری را ذخیره میکند
-- هر بولک یا صفحه نمیتواند اطلاعاتی را ذخیره کند
-- بنابراین هیچ کاربر دیگری نمیتواند موارد مختلفی را ذخیره کند
-- به طور پیش فرض هر یک از بلوک ها و یا صفحات هشت کیلوبایت اندازه دارند
-- پس صرفا هر بلوک به صرف نظر از اینکه چند مورد در دالخ ان وجود دارد همیشه هشت کیلو بایت بزرگ است

-- و باز با صرف نظر از اینکه چند مورد در داخل ان ذخیره میشود همیشه هشت کیلو بایت بزرگ است


-- چرا هر بلوک بدون توجه به اینکه چند مورد است در داخل ان بزرگ است!!!
-- چرا اصلا بلوک وجود دارد!!!
-- چرا ما فقط تعدادی از کاربران را در اینجا ذخیره نمیکنیم

-------------------------------------------------------------------------------------------
--  Block Data Layout
-- خب پس ما گفتیم در یک حافظه هیپ چندین بلاک مختلف وجود دارد
-- خب حالا میخواهیم برسی کنیم این بلوک از نظر جسمی چطوری داخل هارد ذخیره میشه
-- خب ما در حال برسی این جدول هستیم65538 که به هربلوک تعدادی صفر اختصاص داده میشه
-- پس بنابراین بلوک اول بلوک صفر نامیده میشود
-- خب حالا برای مثال میخوایم بلوک1 رو مورد برسی قرار بدیم
-- خب در واقع ما داریم به یک جعبه نگاه میکنیم
-- در واقع ما داریم راجع به بخشی از اطلاعات صحبت میکنیم که توی هارد دیسک ما ذخیره میشود
-- در واقع برخی از این صفر ها که درون بلاک قرار میگیرند برای ذخیره اطلاعات
-- مورد استفاده قرار میگیرند
-- پس ما درواقع در حافظه داریم دنبال تعدادی صفرو یک میگردیم
-- پس داده ها در دیسک ما و هدف از هر صفرکوچک و یکی در انجا ذخیره میشود
-- پس ما در اینجاهیچ دسترسی به نام و یا نام کاربری افراد نداریم
-- اینجا فقط بخش کمی از اطلاعات وجود دارد که میتوانیم توسط ان ردیف های مختلفی رو پیدا کنیم


--  Heap File Layout