-- Full Table Scans

-- حالا فرض کنیم میخوایم کوئری بنویسیم که نام شخصی را از جدولی با ما بدهد
-- پس پستگرس از جدول های خودش میخواد که نگاهی به رکورد های خودشون بکنن و اطلاعات رو برگردونن
-- پس زمانی که میخواد روی هرکدوم از این اطلاعات سرچ انجام بده اونا رو فایل هیپ میاره دااخل مموری و روی تک تک شون برسی انجام میده
-- پس ما به عنوان مهندسین پایگاه داده باید سعی کنیم میزان داده های منتقل شده رو به حداقل برسونیم
-- پس ما زمانی که بخوایم از هارد دیسک انقال داده ای رو توی حافظه انجام بدیم باید اول
-- پرسو جو رو اغاز کنیم و تک به تک رکورد هارو برسی کنیم پس زمانی که اینکارو انجام میدیم 
-- بر اساس شماره جدول این پرسو جو ها انجام میشه
-- پس ما هر کوئری مینویسیم باید میشود جدول به صورت کامل اسکن بشه
-- پس ما برسی میکنیم ایا راه کارامد تری وجود داره یاخیر

-----------------------------------------------------------------------
--  What's an Index
-- How an Index Works
-- پس را هی وجود داره که ما مثلا فقط بلوک مرتبط با ان کوئری و اون رکورد خاص رو خارج کنیم
-- به این صورت میتونیم رکورد هایی رو که میخوایم ایندکسشون کنیم


SELECT * FROM instagram.users
CREATE INDEX ON instagram.users(username,email,phone);

-- میتونیم به این صورت حذف رو انجام بدیم
DROP INDEX users_username_email_phone_idx;

---------------------------------------------------------------------------
--  Benchmarking Queries
-- خب حالا میخوایم کدی رو برسی کنیم که واقعا پیداکردن یک کوئری چقدر طول میکشه

EXPLAIN 
ANALYZE 
SELECT 
    * 
FROM 
    instagram.users 
    WHERE email = 'user5@gmail.com';

-- -----------------------------------------------------------
--Downsides of Indexes
-- خب حالا میخوایم مقدار فضایی که توسط جدول کاربران اشغال شده است رو چاپ کنیم

SELECT pg_size_pretty(pg_relation_size('instagram.users'));
-- => 8192 bytes

-- خب حالا میخوام این رو به این صورت اجرا کنیم
SELECT pg_size_pretty(pg_relation_size('instagram.users_username_email_phone_idx'));

---------------------------------------------------------------------

SELECT
      relname,relkind
    FROM
        pg_class
    WHERE
        relkind = 'i';
-- بنابراین این کوئری تمام جدول ها و فهرست ها و توالیو غیره های مختلف رو
-- برای ما نمایش میده
-- و نیاری نیست ما برای کلید های خاص هر ستون ایندکس ایجاد کنیم

-- -------------------------------------------------------------------
