-- A Story on Migrations
 DML,DDL مبحثی مهم در ساختار دیتابیس هست برای عملیات های 

 فرض میکنیم ما مدیرپایگاه داده اینستاگرام هستیم
 و میخوایم با استفاده از این مفهوم برای تغییرات ساختار دیتابیس کاری انجام دهیم
 ما بطوری خاص جدول کامنت هارو دراختیار داریم
 فرض میکنیم این خدمات دیتابیس ما اولین نسخش توی سیتسم لوکال ما هست
 و دومین نسخه اون توی خدمات وب امازون میزبانی شده 


 نسخه اولی که توی لوکال ما هست برای تست ما ایجاد  شدهتا بتونیم
 تغییرات رو نظارت کنیم
  وارد میکنیم AWS زمانی که برسی کردیم تمام تغیرات به درستی کار میکنن اون به پایگاه داده وبی مثل 
  پس درواقع تمام داده های کاربر های واقعی ما درون این دیتابیس مقصد هستن


حالا مثلا یک روزی برنامه نویس های پایگاه داده به شما اطلاع میدن
ما یک ستونی داریم توی کامنت ها که اصلا بازخورد مناسبی نداره
و شما تصمیم میگیرید بنا به دلایلی اون ستون مورد نظر رو تغییر بدین

***
و شما برای مثال این کار انجام میدین
SELECT * FROM instagram.comments
ALTER TABLE instagram.comments RENAME COLUMN contents TO body;

و بعد از گرفتن نتیجه درست به دیتابیس اصلی متصل یمشید و همین تغییر رو داخل اون هم انجام میدین
اما به محض اینکه برنامه لانچ میشه اررور های زیادی رو مبنی بر تغییر یک ستون ALTER
در دیتابیس توی سرور دریافت میکنید


خب حالا خطلاهارو دیدی مجدد دیتابیس اصلی رو به حالت قبل برمیگردونی
و خطلا ها از بین میرن اما هنوزم باید تغییرات مورد نظر رو اعمال کنیم
پس حالا باید چه کاری انجام بدیم

-- Migration Files
-- Issues Solved by Migrations
-- A Few Notes on Migrations Libraries
-- Applying and Reverting Migrations

یک پایگاه داده خالی ایجاد میکنیم برای اینکه بتونی میگرین خودمون رو به صورت انی در هر جایی از سبکه تغییر بدیم

CREATE DATABASE socialnetworks


CREATE SCHEMA instagram;


SELECT * FROM instagram.comments